<a href="https://colab.research.google.com/github/danielotieno/ml-zoomcamp/blob/main/week-02/homework_02.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# Importing Both Numpy and Pandas

import numpy as np
import pandas as pd

In [2]:
# Load the Data

new_york_airbnb = pd.read_csv("https://raw.githubusercontent.com/alexeygrigorev/datasets/master/AB_NYC_2019.csv")

new_york_airbnb.head()

     id  ... availability_365
0  2539  ...              365
1  2595  ...              355
2  3647  ...              365
3  3831  ...              194
4  5022  ...                0

[5 rows x 16 columns]

In [3]:
# Select the columns we will work with

new_york_df = new_york_airbnb[['latitude',
'longitude',
'price',
'minimum_nights',
'number_of_reviews',
'reviews_per_month',
'calculated_host_listings_count',
'availability_365']]

new_york_df.head()

   latitude  longitude  ...  calculated_host_listings_count  availability_365
0  40.64749  -73.97237  ...                               6               365
1  40.75362  -73.98377  ...                               2               355
2  40.80902  -73.94190  ...                               1               365
3  40.68514  -73.95976  ...                               1               194
4  40.79851  -73.94399  ...                               1                 0

[5 rows x 8 columns]

In [5]:
# Find a feature with missing values. How many missing values does it have?

missing_value_feature = new_york_df.isnull().sum()

missing_value_feature

latitude                              0
longitude                             0
price                                 0
minimum_nights                        0
number_of_reviews                     0
reviews_per_month                 10052
calculated_host_listings_count        0
availability_365                      0
dtype: int64

In [6]:
# What's the median (50% percentile) for variable 'minimum_nights'?

min_night_median = new_york_df['minimum_nights'].median()

min_night_median

3.0